[
    {
        "Job No": "1",
        "Title": "Desktop Software Development",
        "Job Page Link": "https://upwork.com/job/Desktop-Software-Development_~01e3e19efe4bf891f1/",
        "Posted": "8 minutes ago",
        "Type": "Ongoing project",
        "Level": "Intermediate",
        "Estimated Time": "More than 6 month",
        "Skill": "Standalone Application Jobs",
        "Detail": "Freelancer that develop and manage desktop,mobile application and web development."
    },
    {
        "Job No": "2",
        "Title": "Include fire base chat on my website",
        "Job Page Link": "https://upwork.com/job/Include-fire-base-chat-website_~01c7063d1fa0204c06/",
        "Posted": "16 minutes ago",
        "Type": "One-time project",
        "Level": "Entry level",
        "Estimated Time": "No Data",
        "Skill": "PHP Jobs",
        "Detail": "On my IOS app I have already a FireBase chat and I would like to implement this chat on my web site, do you have the knowledge for that ? it's on PHP.\n\nMy chat is very simple, no need feature\n\nthis is the format of one message first message\n\nand if you are on the page ma-loon.com/live.php?username=axel, on the chat you show only the new message where the streamLink = https://stream.ma-loon.com/hls/axel.m3u8\n\nfor the name of user you use $_COOCKIES[\"username\"]\n\nno need registration or login\n\njust do a verification if $_COOCKIES[\"username\"] is set, if is not set the user can write a message\n\nprint user number connected also\n\non mobil look like second image\n\nand web look like third image\n\nand actually I have https://ma-loon.com/dev/live.php?name=cafedelmar"
    },
    {
        "Job No": "3",
        "Title": "QA for a website",
        "Job Page Link": "https://upwork.com/job/for-website_~015fba769269770ee3/",
        "Posted": "17 minutes ago",
        "Type": "One-time project",
        "Level": "Intermediate",
        "Estimated Time": "Less than 1 month",
        "Skill": "Automated Testing Jobs",
        "Detail": "What you’ll do:\n\n- Collaborate with other QA Analysts, Engineers, Product Leads, and Software Engineers to define, implement, and document test strategy and best practices\n- Leverage usage data and product awareness to prioritize and advocate for issues in the backlog\n- Thoroughly test and validate all new features/bug fixes added to our projects to optimize for quality and usability\n- Work closely with developers to write test cases for all new features\n- Run diagnostics and effectively report discovered issues to Engineers and Project Leads\n\nSkills and knowledge you should possess:\n- Comprehension of various types of testing, including Discovery, Exploratory, Context-Driven, and Regression Testing\n- Experience using data to assign priority to issues\n- Empathy for how users interact with products\n- Excellent communication skills and the ability to capture and provide supporting data\n- Comfortable collaborating with other Testers, Software Engineers, and Support Analysts\n- Ability to recognize and run a diagnosis on visual and functional regressions\n- Experience testing across multiple platforms (Web and Mobile)\n- Creative thinking to optimize test approach and efficiency\n- Proven experience as a Quality Assurance Tester or similar role\n- Experience in project management and QA methodology\n- Familiarity with Agile frameworks and regression testing is a plus\n- Ability to document and troubleshoot errors\n- Working knowledge of Bug Tracking software (e.g. JIRA or Trello) and SQL\n- Excellent communication skills\n- Attention to detail\n- Analytical mind and problem-solving aptitude\n- Strong organizational skills\n- BSc/BA in Computer Science, Engineering or a related field\n\nResponsibilities:\n- Review and analyze system specifications\n- Collaborate with QA Engineers/developers to develop effective strategies and test plans\n- Execute test cases (manual or automated) and analyze results\n- Evaluate product code according to specifications\n- Create logs to document testing phases and defects\n- Report bugs and errors to development teams\n- Help troubleshoot issues\n- Conduct post-release/ post-implementation testing\n- Work with cross-functional teams to ensure quality throughout the software development lifecycle."
    },
    {
        "Job No": "4",
        "Title": "Need a redesign of the SaSS Sales page (and feature pages)",
        "Job Page Link": "https://upwork.com/job/Need-redesign-the-SaSS-Sales-page-and-feature-pages_~016c1cb0eace5a7598/",
        "Posted": "18 minutes ago",
        "Type": "One-time project",
        "Level": "Intermediate",
        "Estimated Time": "Less than 1 month",
        "Skill": "Wireframes Jobs",
        "Detail": "Hi,\n\nI need a Web Designer to give this page a visual overhaul:\n\nhttps://developers.whatismybrowser.com/api/\n\nRecently I have spent a lot of time rewriting the sales copy and designing/restructuring the new IA/Structure of the page and I'm happy with it, but I'll be the first to admit that I'm no good when it comes to making it *look* amazing.\n\nI need someone to take the copy and page structure and give it a whole new look and feel.\n\nI like the general look and feel of pages like:\n\nhttps://segment.com/\nhttps://graphql.org/\nhttps://vercel.com/\nhttps://sproutsocial.com/\nhttps://dreamdata.io/\n\nI'm also looking eventually to redesign the rest of the general https://developers.whatismybrowser.com/ content pages, and also https://www.whatismybrowser.com too, so I'd be very keen to find the one person to work on all three jobs at some point; the main idea to keep a consistent style across all the sites.\n\n\nDeliverables:\n\nI'll need a PSD of the new design so that I can build it in to the site as well as any other assets you design for the site.\n\nI'm looking forward to discussing the project with you.\n\nBrett"
    },
    {
        "Job No": "5",
        "Title": "Python Fast Job - help me with API Call",
        "Job Page Link": "https://upwork.com/job/Python-Fast-Job-help-with-API-Call_~01bfb5d392987d7520/",
        "Posted": "19 minutes ago",
        "Type": "Ongoing project",
        "Level": "Intermediate",
        "Estimated Time": "No Data",
        "Skill": "Python Jobs",
        "Detail": "I need you to make function in Python that make the authorisation (function is ready in NodeJS  ):\n\nPrivate HTTP API Methods\nThe private HTTP API allows read / write access to your private account.\n\nPrivate endpoint is: `https://extstock.com`\nAll calls to the trading API are sent via HTTP using POST parameters to https://extstock.com and must contain the following headers:\n\nx-api-key: Your PUBLIC key;\nx-api-signature: HMAC-generated request signature; *\nx-api-tonce: Timestamp in integer, stands for milliseconds elapsed since Unix epoch. Tonce must be within 30 seconds of server's current time. Each tonce can only be used once.\n* In order to sign the request, one should perform HMAC-SHA512 with the following parameters:\nprivateKey: Your PRIVATE key.\nmessage: The result of concatenation path + tonce + body, where path is a URL-path of the request with parameters, e.g. /api/v2/trading/balances, tonce is a value passed in x-api-tonce header, body is a request body\nAll responses from the trading API are in JSON format.\n\n\nlink to docks:\nhttps://extstock.com/documents/api\n\n\ni need to use function:\nPOST /api/v2/trading/balances\nPOST /api/v2/trading/order/create"
    },
    {
        "Job No": "6",
        "Title": "Design dashboard templates for data visualizations with our own software, the Peakboard Designer",
        "Job Page Link": "https://upwork.com/job/Design-dashboard-templates-for-data-visualizations-with-our-own-software-the-Peakboard-Designer_~011017caf9e77fbc03/",
        "Posted": "28 minutes ago",
        "Type": "Ongoing project",
        "Level": "Entry level",
        "Estimated Time": "More than 6 month",
        "Skill": "API Integration Jobs",
        "Detail": "About us:\n\nWe are Peakboard, a start up from Stuttgart, Germany. Peakboard is an all-in-one solution of hardware and software that communicates data from different sources for the operative business in a simple, efficient and individually customized way. Founded in 2016, we have one goal: efficient visualization of complex data and processes in real time. Find out more about us: https://peakboard.com/en/\n\n\nAbout the project:\n\nWe are looking for a web developer who can help us create dashboard templates for our website. The project is not necessarily an actual web project, however it requires the skillset of a web developer. You will for example have to talk to APIs and accumulate, prepare and visualize data in an understandable and attractive way in the form of a dashboard.\n\nThe dashboard templates that you create will then be displayed on our website es part of the template portal https://templates.peakboard.com.\n\n\nAbout the Job:\n\nWe develop new ideas for actual use cases of the Peakboard box every day. Your job will be to realize our ideas and turn them into actual templates, using our own software, the Peakboard designer.\n\nTherefore you will have to think about how to store the data, what the raw data could look like in the actual environment, how to work with it and prepare it and how the dashboard could look like in the end. We will of course brief you thoroughly and draw out the ideas on paper beforehand. Also, you will receive feedback regularly and we will support you with our knowledge.\n\nTo get started, you will be needing nothing but your imagination and the Peakboard Designer, our own software and design tool, which can be downloaded for free: https://peakboard.com/peakboard-designer/ The preview function in the Peakboard Designer simulates the final visualization on the Peakboard box.\n\nWe’re looking for a long-term relationship, because we are constantly in need of new templates. As a first step we would like to create a first paid test template with you. You’ll receive more details about it after getting in touch with us."
    },
    {
        "Job No": "7",
        "Title": "HTML (to PDF) Template modifications",
        "Job Page Link": "https://upwork.com/job/HTML-PDF-Template-modifications_~017e823d581e38fe74/",
        "Posted": "43 minutes ago",
        "Type": "One-time project",
        "Level": "Intermediate",
        "Estimated Time": "No Data",
        "Skill": "Web Design Jobs",
        "Detail": "What is given:\n\n* Django (Python3) Template which are converted into an PDF (2 pages) using PhantomJS\n* PNG files for PDF header and footer\n* Django template uses html head style tag for style definition and imports 1 basic general style sheet.\n\nDeliverable:\n* modified Django template with matching design. design is provided as DOCX document\n\nGeneral Background:\n\nWe are Germany based IT professionals and are using this kind of small fast low budget tasks to screen for developers. Long term goal is to find freelance partners with Excellence in delivery, communication and reliability for our large scale clients."
    },
    {
        "Job No": "8",
        "Title": "Web Development",
        "Job Page Link": "https://upwork.com/job/Web-Development_~013f7e2e53cf85b01d/",
        "Posted": "47 minutes ago",
        "Type": "One-time project",
        "Level": "Entry level",
        "Estimated Time": "No Data",
        "Skill": "No Data",
        "Detail": "I Want  to make a website  like this - https://freshersnaukri.in/cpcb-ldc-mts-deo-others-online-form-2020/ (check full site) plz contact asap.."
    },
    {
        "Job No": "9",
        "Title": "HTML developer needed for creating a mobile html theme",
        "Job Page Link": "https://upwork.com/job/HTML-developer-needed-for-creating-mobile-html-theme_~0179a8259b75a34083/",
        "Posted": "49 minutes ago",
        "Type": "One-time project",
        "Level": "Intermediate",
        "Estimated Time": "No Data",
        "Skill": "Web Application Jobs",
        "Detail": "Need to generate html code for mobile layout.\nI want to get bootstrap 4 theme."
    },
    {
        "Job No": "10",
        "Title": "Native Developeur for application mobile",
        "Job Page Link": "https://upwork.com/job/Native-Developeur-for-application-mobile_~012a5fb121fab313ef/",
        "Posted": "52 minutes ago",
        "Type": "Ongoing project",
        "Level": "Intermediate",
        "Estimated Time": "No Data",
        "Skill": "Phone Jobs",
        "Detail": "We are upgrading our mobile apps from web view to native ones. Our business : To bring influencers and web visibility on establishments to promote them through their events.\nOur back-end provides an API matching OpenAPI requirements. A Swagger interactive documentation is available to be able to test the API without integration first.\n\nWhat are we working with (tech part)?\n\n- development of mobile applications (iOS Swift - Android Kotlin).\n   We use Clean Architecture. If you don't know it before apply, this job is not for you. 🙂\n\n- use of rest api (Swagger).\n   If you have never use a swagger ui to test your requests before, this jobs is not for you. 🙂\n\n- working with a graphic designer to integrate his designs\n  We provide a XD file. If you cannot open large XD files, this job is not for you. 🙂\n\n- use of git (with Gitlab)\n  Our common workflow is new branch, push, merge request, review, merge and so on. If a rebase scares you, this job is not for you. 🙂  \n\n- unit tests\n  Not any Merge Request will be validated without test. If you don't do tests, this job is not for you. 🙂"
    },
    {
        "Job No": "11",
        "Title": "Shopify Store Development: 2x 'Discover All Businesses' Button On Home Page",
        "Job Page Link": "https://upwork.com/job/Shopify-Store-Development-Discover-All-Businesses-Button-Home-Page_~017028aa431a742c35/",
        "Posted": "59 minutes ago",
        "Type": "One-time project",
        "Level": "Intermediate",
        "Estimated Time": "No Data",
        "Skill": "Web Design Jobs",
        "Detail": "Hello, thanks for reviewing my job here and nice to virtually shake hands...\nI hope that you're managing to stay healthy!\n\nI am a Shopify Partner and I specialise in designing and selling Shopify stores but I am in the process of scaling up and am designing myself a store - to sell my Shopify stores!\n\nThe Website to add buttons to is: startupstreams.com\n\nI need someone who can add 2x 'Discover All Businesses' (View collection) buttons. They need to be in the same style as my website's buy now buttons to create a cohesive brand image and I need to be able to edit/experiment with the button text as well as being able to change the collection the button points to. There also needs to be a smaller text field which I can edit freely. For now I would like it to say 'MONEY BACK GUARANTEE'.\n\nThis button would need to be optimised for ALL devices.\n\nIn terms of positioning, I would need one just below the hero image and one just before the footer.\n\nFor your reference, I have provided 2x mock ups to show you EXACTLY what I am after...\n\nPlease let me know if you need ay further explanations? Thanks in advance!\n- Eddie"
    },
    {
        "Job No": "12",
        "Title": "senior Ruby on Rails DEV",
        "Job Page Link": "https://upwork.com/job/senior-Ruby-Rails-DEV_~0110aa5289626738ae/",
        "Posted": "1 hour ago",
        "Type": "Ongoing project",
        "Level": "Expert",
        "Estimated Time": "3 to 6 month",
        "Skill": "API Jobs",
        "Detail": "Need some one with experience in language\n\nRuby on Rails, JAVA or HTML\n\nfor part time fixing our current web\n\nambassador.saintlbeau.com\n\nthis will be a long term jon, fixing bugs and adding more feature into what we already have\n\nPlease let us know if you already done project like this before? and send us your porfolios"
    },
    {
        "Job No": "13",
        "Title": "web scraping and reverse engineering web API's",
        "Job Page Link": "https://upwork.com/job/web-scraping-and-reverse-engineering-web-API_~014eb172c0b1e2ce7d/",
        "Posted": "1 hour ago",
        "Type": "Ongoing project",
        "Level": "Intermediate",
        "Estimated Time": "Less than 1 month",
        "Skill": "API Jobs",
        "Detail": "Needs to hire 3 Freelancers\nHow would you like to be part of history?\n\nWe are an eCommerce startup looking to shake up and completely change the industry.\nEcom Solutions is an ecosystem of automation tools designed to help online arbitrageurs and online brands stay in compliance with multiple market places such as Amazon, eBay, Shopify, and more.\n\nYou will be working under Senior developers\n\n\nWe are currently looking for Web developers with experiences below\n\nWeb scraping\nKnowledge of E-commerce platforms/software\nreverse engineering API's\nJavascript\npayment gateways\n\n\n\nIf you meet any of these requirements feel free to talk to us, looking forward to working with you!"
    },
    {
        "Job No": "14",
        "Title": "Expert Wordpress Designer & Developer",
        "Job Page Link": "https://upwork.com/job/Expert-Wordpress-Designer-amp-Developer_~0147d2a3b4d5c0fa0a/",
        "Posted": "1 hour ago",
        "Type": "Ongoing project",
        "Level": "Expert",
        "Estimated Time": "No Data",
        "Skill": "Website Jobs",
        "Detail": "Looking to partner with someone to handle all of my Wordpress Website Projects. Need to be talented designer who can adhere to deadlines, handle revisions, expert in wordpress, expert with woocommerce for ecommerce projects, can troubleshoot bugs, preferably knowledgable of Elementor, and must be creative. If this is you then please show me examples of your work."
    },
    {
        "Job No": "15",
        "Title": "Building API connectors for an open-sourced crypto trading bot",
        "Job Page Link": "https://upwork.com/job/Building-API-connectors-for-open-sourced-crypto-trading-bot_~017042c5aa95335f13/",
        "Posted": "1 hour ago",
        "Type": "Ongoing project",
        "Level": "Intermediate",
        "Estimated Time": "No Data",
        "Skill": "Python Jobs",
        "Detail": "We are looking to enhance a PYTHON open source cryptocurrency trading bot (https://github.com/CoinAlpha/hummingbot) by connecting 2 new platforms via new exchange connectors.\n\nDo note that we are not looking for a brand new bot, but to instead we specifically need you to set up connectors so that the existing strategies can be used.\n\nWe are looking for an experienced python developer that can help us do this task. The community has already contributed a few exchange connectors and you can refer the link to assess difficulty and time required."
    },
    {
        "Job No": "16",
        "Title": "Question and answer generator",
        "Job Page Link": "https://upwork.com/job/Question-and-answer-generator_~01ff3f0eb013f5e1df/",
        "Posted": "1 hour ago",
        "Type": "One-time project",
        "Level": "Entry level",
        "Estimated Time": "Less than 1 month",
        "Skill": "API Jobs",
        "Detail": "I’m looking to make a very basic website/app where I can upload a question, record a video or voice answer, and time this. Is this something you can help with? I need an admin login too so I can change/upload new questions and answers. I need a basic functioning prototype on the first instance. However, this is likely to be an ongoing and bigger project if the initial prototype is satisfactory. Thank you."
    },
    {
        "Job No": "17",
        "Title": "Build custom checkout",
        "Job Page Link": "https://upwork.com/job/Build-custom-checkout_~01404ac42a9ebbd169/",
        "Posted": "1 hour ago",
        "Type": "Ongoing project",
        "Level": "Expert",
        "Estimated Time": "More than 6 month",
        "Skill": "Web Design Jobs",
        "Detail": "We need to build a checkout for our website:\n\n1. It'll send the order to Shopify\n2a. Checkout will work with Stripe & PayPal\n2b. They can pay with one click with Google Pay or Apply Pay.\n3. After the payment is done, it'll go to a one-click upsell page (to purchase an additional item, without entering the credit card details again)\n4. After several one-click upsells are done, the user will go to a thank you page\n5. On the checkout page, he'll have a tick box to mark with bump offer\n\n** If the user left the checkout AFTER he gave the payment details on the checkout page, without reaching the THANK YOU page, he'll still be charged.\n\nExamples:\n\nhttps://carthook.com/\nhttps://cartflows.com/\nhttps://www.samcart.com/\nhttps://www.clickfunnels.com/\nhttps://thrivecart.com/special-offer/"
    },
    {
        "Job No": "18",
        "Title": "Need a Web developer to work on a car wash and cleaning service website.",
        "Job Page Link": "https://upwork.com/job/Need-Web-developer-work-car-wash-and-cleaning-service-website_~012b8fd71a1f4f12e0/",
        "Posted": "1 hour ago",
        "Type": "One-time project",
        "Level": "Intermediate",
        "Estimated Time": "No Data",
        "Skill": "Website Development Jobs",
        "Detail": "The project includes simple website development having pages like; Home page, profile, our services, book your service, FAQ, Contact etc. we need an experienced web developer having experience in developing and designing clean and brand oriented website.\n\n\nI'll send more details about the project during the interview"
    },
    {
        "Job No": "19",
        "Title": "developer needed for customizing and finishing a bare WordPress based blog",
        "Job Page Link": "https://upwork.com/job/developer-needed-for-customizing-and-finishing-bare-WordPress-based-blog_~01fec9cf4798ae0aa2/",
        "Posted": "1 hour ago",
        "Type": "One-time project",
        "Level": "Intermediate",
        "Estimated Time": "No Data",
        "Skill": "WordPress Website Jobs",
        "Detail": "My website is a blog related to home decor and DIY. I'm looking for a developer cum designer to customise and finish the website from its current form. I already have a target website on which my website is to be modeled upon. The UI/UX of the website will be almost the same as that website. Site speed is extremely important for this website, hence the plugins used should be minimal. Any plugin used should be permitted explicitly by me. Anything that could slow down the website considerably cannot be used. The website is currently using Generatepress (Pro) child theme. All changes should be made in the child theme.\n\nOverall the website is to be minimalist and simple in style and functionality."
    },
    {
        "Job No": "20",
        "Title": "Looking for Front - Back End developer to work in a new real estate Platform (Website & Mobile App)",
        "Job Page Link": "https://upwork.com/job/Looking-for-Front-Back-End-developer-work-new-real-estate-Platform-Website-amp-Mobile-App_~01eab090334d5a05e9/",
        "Posted": "1 hour ago",
        "Type": "Ongoing project",
        "Level": "Expert",
        "Estimated Time": "More than 6 month",
        "Skill": "API Jobs",
        "Detail": "Hay, I’m looking for Front - Back End Professional developers to work with me in a new Real Estate Project.it will be a long-term collaboration, Looking for someone to be a part of the project, not just one-time task.  Can take complex ideas and translate them into an actionable development plan, pay attention to details. Have an awesome design skill, Help to bring new ideas to the platform. have a great experience and expertise in building fully automated systems to automate the repeated web workflows.  the hourly rate is $20 - $25\n\nThank You,"
    },
    {
        "Job No": "21",
        "Title": "Looking for Front - Back End developer to work in a new real estate Platform (Website & Mobile App)",
        "Job Page Link": "https://upwork.com/job/Looking-for-Front-Back-End-developer-work-new-real-estate-Platform-Website-amp-Mobile-App_~01eab090334d5a05e9/",
        "Posted": "1 hour ago",
        "Type": "Ongoing project",
        "Level": "Expert",
        "Estimated Time": "More than 6 month",
        "Skill": "API Jobs",
        "Detail": "Hay, I’m looking for Front - Back End Professional developers to work with me in a new Real Estate Project.it will be a long-term collaboration, Looking for someone to be a part of the project, not just one-time task.  Can take complex ideas and translate them into an actionable development plan, pay attention to details. Have an awesome design skill, Help to bring new ideas to the platform. have a great experience and expertise in building fully automated systems to automate the repeated web workflows.  the hourly rate is $20 - $25\n\nThank You,"
    },
    {
        "Job No": "22",
        "Title": "Angular, Nodejs Developer (MEAN Stack)",
        "Job Page Link": "https://upwork.com/job/Angular-Nodejs-Developer-MEAN-Stack_~01018e63e196534e58/",
        "Posted": "1 hour ago",
        "Type": "Ongoing project",
        "Level": "Expert",
        "Estimated Time": "1 to 3 month",
        "Skill": "Web Design Jobs",
        "Detail": "We are looking to hire a full stack developer for our global platform for filmmakers.\n\nREQUIRED:\n\nYou must have strong Nodejs/Angular 8/9 experience and expertise with networking, security, SQL and NoSQL database designs, logging, monitoring, serverless framework, serverless architectures, functional programming and Typescript.\n\nTech Stack:\n\nNode.JS\n\nMongoDB\n\nCSS\n\nHTML\n\nAngular 8/9\n\nTypeScript\n\nLESS CSS\n\nJavascript"
    },
    {
        "Job No": "23",
        "Title": "15 page website with payment gateway",
        "Job Page Link": "https://upwork.com/job/page-website-with-payment-gateway_~01896d5f82c88655ce/",
        "Posted": "1 hour ago",
        "Type": "One-time project",
        "Level": "Intermediate",
        "Estimated Time": "No Data",
        "Skill": "App Development Jobs",
        "Detail": "Site up and running on GoDaddy.\nDeveloper and graphics designer"
    },
    {
        "Job No": "24",
        "Title": "Looking for a web developer for an on line tutoring business",
        "Job Page Link": "https://upwork.com/job/Looking-for-web-developer-for-line-tutoring-business_~01ac371d2db12ca171/",
        "Posted": "1 hour ago",
        "Type": "One-time project",
        "Level": "Intermediate",
        "Estimated Time": "No Data",
        "Skill": "No Data",
        "Detail": "“ I would like to ask if you are familiar with Chegg Tutors? (Or any other online tutoring website) Because that is the actual platform/software that I would need my own platform to be based on, to be able to operate and run an online tutorial business. As of the moment, I own and manage an on-site tutorial school, but due to recent developments and circumstances surrounding the Covid-19 pandemic, I thought it would be best to be able to migrate to a better arrangement with my students and teachers, in order for us to be able to continue and teach our students safely and securely. I am not that technically knowledgeable of all things IT, so we thought of seeking help from people like you, and opt to choose the best among the ones who replied here favorably in response to our need. Right now, and as to how we are doing it on-site, we need to be able to “translate” our in-session tutoring to an online portal where we can teach students with all subjects needed for daily class activities, homework help, and other academic needs. So by that, we need a virtual classroom with a virtual whiteboard also, that would enable us to teach not only language subjects, but also Math, the Sciences, and the like. So the software or platform that we need is something that would have those initial functions, like audio-visual and text capabilities, one-on-one and group setting tutorials, screen-sharing, etc… It would be very helpful in our choosing whoever will be assigned to commission this project, if you have done something similar in the past, or have developed a program such as the one we require. Thanks very much.”"
    },
    {
        "Job No": "25",
        "Title": "Virtual Classroom API - add LearnCube REST API to wordpress site",
        "Job Page Link": "https://upwork.com/job/Virtual-Classroom-API-add-LearnCube-REST-API-wordpress-site_~017ed84ecafaa50eee/",
        "Posted": "2 hours ago",
        "Type": "One-time project",
        "Level": "Entry level",
        "Estimated Time": "No Data",
        "Skill": "Backend Rest API Jobs",
        "Detail": "I have a small language center in Panama and I need to move it online bc of Covid. I am going to do it with Learncube. It will be white-labeled (my own brand) so I can grow into it. The way they do that is through a REST API. I currently have a Wordpress website that I would like it \"connected\" to.\nI have attached all of the directions and a picture of what the overall process looks like. I would like to start as soon as I find someone. They said it should only take a few hours so I would like it up and running on the same day.\nThe end result will look like their page (that you will enter) where I currently have classes but, it will be on my site with no trace of their brand."
    },
    {
        "Job No": "26",
        "Title": "Upgrade Open Cart 1.5 to 3.0",
        "Job Page Link": "https://upwork.com/job/Upgrade-Open-Cart_~01b03053f23c949aac/",
        "Posted": "2 hours ago",
        "Type": "One-time project",
        "Level": "Intermediate",
        "Estimated Time": "Less than 1 month",
        "Skill": "OpenCart Jobs",
        "Detail": "We have a big store on Open Cart 1.5 version which we want to upgrade to latest version 3.0.\nIt's working perfectly and we have many orders/users and good SEO ranking.\nLooking for someone who can migrate it fast without damaging SEO or anything else.\n\nOnly experienced people with live examples.\nNeed someone ASAP."
    },
    {
        "Job No": "27",
        "Title": "Senior Java Developer with Spring MVC",
        "Job Page Link": "https://upwork.com/job/Senior-Java-Developer-with-Spring-MVC_~01e9c1385b97ef616d/",
        "Posted": "2 hours ago",
        "Type": "Ongoing project",
        "Level": "Expert",
        "Estimated Time": "3 to 6 month",
        "Skill": "Java Jobs",
        "Detail": "• 5-10 years of software engineering experience\n• Extensive programming skills in Java/core java\n• Spring MVC, J2EE\n• Strong database experience (MYSQL, SQL)\n• knowledge and experience in HTML5, CSS3, JavaScript is appreciated\n• In-depth understanding of web service (SOAP and Restful APIs)\n• Experience developing applications for the cloud desired\n• Knowledge of Agile methodologies and principles\n• Good communication skills and flexibility to working with global team"
    },
    {
        "Job No": "28",
        "Title": "Virtual Assistant For Growing Ecommerce Advertiser",
        "Job Page Link": "https://upwork.com/job/Virtual-Assistant-For-Growing-Ecommerce-Advertiser_~010ad55f06d0ff7ec6/",
        "Posted": "2 hours ago",
        "Type": "Ongoing project",
        "Level": "Expert",
        "Estimated Time": "More than 6 month",
        "Skill": "Executive Jobs",
        "Detail": "Hello, We are an eCommerce advertiser that is seeking a highly motivated virtual assistant with experience with the advertising industry. I'm specifically looking for someone that I can train to take over a lot of the tasks that I'm currently doing. The goal here is to build out standard operating procedures that can be followed so that the current work efforts become more efficient and productive. There will be monthly bonuses that will be rewarded based upon performance.\n\nHere is a list of things that I'm specifically seeking help with:\n\n* Managing web development team\n* Managing design team\n* Managing copywriters\n* Managing Customer Support team\n* Managing fulfillment\n* Managing media team\n* Managing reporting\n* Managing creative team\n\n\nIf you think you would be a good fit please get back to me with a brief explanation of your past experience. Looking to hire someone this week so make sure you take advantage of this great opportunity before it's too late."
    },
    {
        "Job No": "29",
        "Title": "Hydroponic IOT parameters monitoring dashboard",
        "Job Page Link": "https://upwork.com/job/Hydroponic-IOT-parameters-monitoring-dashboard_~01ee1ab59290689640/",
        "Posted": "2 hours ago",
        "Type": "One-time project",
        "Level": "Intermediate",
        "Estimated Time": "1 to 3 month",
        "Skill": "UX/UI Jobs",
        "Detail": "Minimum Setup with:\n\nBackend Server on cloud\n-01. Data Processing Engine\n-02. Logic engine\n-03. Notification engine\nFront End Dashboard\n-04. Web Page for data Visualization"
    },
    {
        "Job No": "30",
        "Title": "Cannabis - a2j (Access to Justice) - Grant Consultant",
        "Job Page Link": "https://upwork.com/job/Cannabis-a2j-Access-Justice-Grant-Consultant_~011781092ba74bf226/",
        "Posted": "2 hours ago",
        "Type": "Ongoing project",
        "Level": "Intermediate",
        "Estimated Time": "3 to 6 month",
        "Skill": "Communication Jobs",
        "Detail": "We are a group of legal service providers in Ontario and are developing a client friendly web information system, that will keep the clients instantly updated on their file and allow legal coaching access for remote and economically stressed individuals. This service can provide self-represented litigants with appropriate case management, case law research support, document preparation and moot court (practice court) preparation time for their hearings. In Canada, the amount of self-represented litigants with no resources and with very little support, face an ever growing complex legal administration system with complex procedural restraints and timelines that if missed, can see their case dismissed. With the support of experienced freelance members of the Law Society, we hope to equalize and level the \"playing field\". We need someone who can undertake the task of locating and applying for a grant from the Federal Government, Provincial Government, Municipal Governments and other relevant institutions."
    },
    {
        "Job No": "31",
        "Title": "Woocommerce/Wordpress expert",
        "Job Page Link": "https://upwork.com/job/Woocommerce-Wordpress-expert_~010dff960f4aa7f066/",
        "Posted": "2 hours ago",
        "Type": "One-time project",
        "Level": "Intermediate",
        "Estimated Time": "No Data",
        "Skill": "Web Design Jobs",
        "Detail": "We are looking for a WooCommerce/Wordpress expert that can implement robust machine learning algorithm related to eCommerce recommendations.\nOur business is a leading startup in Wine industry and our project has the goal to create an algorithm that can predict , which wine our customer will probably like based on a 7-question quiz in addition to there online behavior.\nThe freelancer or the agency should have the following skills:\n- Strong UX/UI experience\n- Excellent development methodology\n- Perfect coding quality and standard\n- AI and ML expert\n- Wordpress expert\nif you have the required skills, please apply to this position for a long term partnership.\nBest regards,\nRomain"
    },
    {
        "Job No": "32",
        "Title": "shopify app developer to create app to sync products from many stores to a MYSQL DB",
        "Job Page Link": "https://upwork.com/job/shopify-app-developer-create-app-sync-products-from-many-stores-MYSQL_~01446511a74b0bbab1/",
        "Posted": "2 hours ago",
        "Type": "Ongoing project",
        "Level": "Intermediate",
        "Estimated Time": "Less than 1 month",
        "Skill": "Shopify Jobs",
        "Detail": "Attention Shopify experts, or API developers!\n\nWe need to build an APP for the shopify app store, that will sync products from many shopify stores, to a MYSQL DB (using laravel API) and then push them across to prestashop.\n\nWe have the idea, can provide mockups.\n\nIdeally, you will understand how to create a shopify app (although not necessary)\nbut you will need the following skills:\n\n- Node\n- ReactJS\n- API understanding\n- Webhooks\n\nYou will be working with a senior developer / project manager\n\nThe OBJECTIVE:\nThe app needs to read products from a shopify stores and sync them to MYSQL DB\n\nGet in touch with your skills"
    },
    {
        "Job No": "33",
        "Title": "Developer needed to create Wordpress website",
        "Job Page Link": "https://upwork.com/job/Developer-needed-create-Wordpress-website_~01773127b64b02d65a/",
        "Posted": "2 hours ago",
        "Type": "One-time project",
        "Level": "Expert",
        "Estimated Time": "No Data",
        "Skill": "Wireframes Jobs",
        "Detail": "an active website for use of Business coaching\nlooking to use the wordpress platform\nHeading\ncontact details\noutline of services\nfind image to use"
    },
    {
        "Job No": "34",
        "Title": "Full-time Full-Stack Web Developer (React, Redux, PHP, Laraval)",
        "Job Page Link": "https://upwork.com/job/Full-time-Full-Stack-Web-Developer-React-Redux-PHP-Laraval_~012fc6bfa6ec613c56/",
        "Posted": "2 hours ago",
        "Type": "Ongoing project",
        "Level": "Expert",
        "Estimated Time": "No Data",
        "Skill": "API Jobs",
        "Detail": "Looking to hire full-stack developers. This is a full-time job, 40 hours a week.  The pay is $1,000 a month.  The job can go on for as long as one year if you exceed expectations. This is only for developers who are fluent in English and very detailed oriented.  Those developers who have met our expectation, have been with us for years.  \n\nYou must be willing to work during the hours allocated, part of it will be California hours (non-negotiable).  During the first month, if you don't meet the rigor of our company's culture or expectation, we have the right to cut off the relationship and pro-rate your payment.  We will do everything in our power to make you successful.\n\n\nRequirements\n\n-  Ability to communicate in English fluently\n-  Computer Science, Information Technology degree, or equivalent experience\n-  Equally versed in both Front-End and Back-End Development\n-  Strong capability of troubleshooting\n-  Experience with data structures, algorithms, and big data\n-  Strong understanding of HTML, CSS, JavaScript, and nodejs, react, redux\n-  Understanding of MVC frameworks\n-  Knowledge of working with GitHub.\n-  Experience with XML, JSON, Restful services, and SOAP\n-  At least four years experience with PHP5 and up (Java, C++ acceptable), MYSQL Client, and server\n\nSend us a self-recorded video of the website you have developed using React and/or Redux and/or PHP Laraval.  Explain briefly about your experience and your interest in a long term work relationship.\n\nDownload Loom screen recording\nMake a recording of yourself and share it with me\nYour recording should also show some of the work you have done.\n\nOnce done, include that as a message on Upwork.\n\nJob Type: Full-time"
    },
    {
        "Job No": "35",
        "Title": "ReactJS developer needed to fix bugs on existing web app",
        "Job Page Link": "https://upwork.com/job/ReactJS-developer-needed-fix-bugs-existing-web-app_~01df175cf05a4f4f98/",
        "Posted": "2 hours ago",
        "Type": "One-time project",
        "Level": "Intermediate",
        "Estimated Time": "No Data",
        "Skill": "Website Jobs",
        "Detail": "We have a web app which has already been developed and is filled with bugs (mostly UI and a very few functionality bugs.) Most of the bugs are pretty simple to fix.\n\nWe're looking for freelancers who can quickly execute and fix these tasks. Timeline for this project is just 2 days."
    },
    {
        "Job No": "36",
        "Title": "PHP Developer Required",
        "Job Page Link": "https://upwork.com/job/PHP-Developer-Required_~0144894fea2fa27af0/",
        "Posted": "2 hours ago",
        "Type": "Ongoing project",
        "Level": "Expert",
        "Estimated Time": "More than 6 month",
        "Skill": "Database Architecture Jobs",
        "Detail": "We are looking for a PHP developer who has strong expertise in CodeIgnitor/Laravel with MySQL Database.\nYou have to develop the entire back-end functionality according to the mock-ups.\nYou must know Git.\nYou must have the ability to code fast with the best logic.\nYou must have expertise in coding Secure Admin Dashboard Sytems, Secure Registration & Login Systems, API Integrations, and others which are related to the backend functionality.\nYou must have a strong knowledge of JavaScript.\nYou must be able to push the code on the Git on an hourly basis.\nMust have strong expertise in coding utilities."
    },
    {
        "Job No": "37",
        "Title": "i need the website like this website https://adshrink.it/lJXOmH",
        "Job Page Link": "https://upwork.com/job/need-the-website-like-this-website-https-adshrink-lJXOmH_~0178d15cc6d0a4c7e3/",
        "Posted": "2 hours ago",
        "Type": "One-time project",
        "Level": "Expert",
        "Estimated Time": "Less than 1 month",
        "Skill": "Website Development Jobs",
        "Detail": "if you make life this https://adshrink.it/lJXOmH website plz contact"
    },
    {
        "Job No": "38",
        "Title": "Website Revamp",
        "Job Page Link": "https://upwork.com/job/Website-Revamp_~0147413a02df6e3103/",
        "Posted": "3 hours ago",
        "Type": "One-time project",
        "Level": "Expert",
        "Estimated Time": "Less than 1 month",
        "Skill": "Mobile App Design Jobs",
        "Detail": "Two hours of work to make our website look great- we don't need any help with content or technical support, but e do need help with aesthetics. Experience with word press needed- opportunity for more work if we are happy with the result!"
    },
    {
        "Job No": "39",
        "Title": "Sales Development Executive for Tech Agency",
        "Job Page Link": "https://upwork.com/job/Sales-Development-Executive-for-Tech-Agency_~01036e9b3941c615a0/",
        "Posted": "3 hours ago",
        "Type": "One-time project",
        "Level": "Entry level",
        "Estimated Time": "More than 6 month",
        "Skill": "Sales Development Jobs",
        "Detail": "We are looking for a motivated high ticket sales closer that will close warm leads (possibly cold as well) over the emails or calls.\n\nWe provide all kinds of web, mobile, and software development services. Currently, we are looking for an accelerated person who can generate the US and European country/market-based leads and follow-up with them on end to end basis, further converting the leads into clients with landing projects for our company.\n\nYou'll be paid on an hourly basis for the pre-sales work you do with that for every sale you close you will get 10-15% of the retainer based on the project size you land/close.\n\nWe will get all of the useful tools you need for data mining or generating leads, meaning that you only have to focus on taking the calls and communicating with the prospects. These will all be warm leads to start off with (unless you are confident with making cold calls as well).\n\nWe are a growing company therefore your engagement with us will be for a longer period of time.\n\nWhat we are looking for:\n- An experienced high ticket closer (sales call expert)\n- A good communicator\n- Motivated and driven to succeed\n- Wants to be part of a growing software development agency\n\nThank you for reading, I am very excited to hear from you."
    },
    {
        "Job No": "40",
        "Title": "Squarespace developer needed to add javascript to Squarespace site",
        "Job Page Link": "https://upwork.com/job/Squarespace-developer-needed-add-javascript-Squarespace-site_~012ce68991723de083/",
        "Posted": "3 hours ago",
        "Type": "One-time project",
        "Level": "Intermediate",
        "Estimated Time": "No Data",
        "Skill": "Web Design Jobs",
        "Detail": "I am a designer wanting to add this draggable functionality https://codepen.io/rozacp/pen/eYmwyqy\nto my Squarespace site for a client. With a logo overlay. I need a developer to create this custom CSS (Squarespace friendly) for me to add to my site."
    },
    {
        "Job No": "41",
        "Title": "Developer Needed for work with company-work from home",
        "Job Page Link": "https://upwork.com/job/Developer-Needed-for-work-with-company-work-from-home_~0181aa124341507a7f/",
        "Posted": "3 hours ago",
        "Type": "Ongoing project",
        "Level": "Expert",
        "Estimated Time": "No Data",
        "Skill": "Phone Jobs",
        "Detail": "Profile:- Android Developer, Java Developer, Web Developer, PHP Developer\nVacancies:- 10\nRequired Skill:-\nFront End:-Android Studio, Angular 5/6, Advanced Java, PHP\nDatabase:- mySql, mongoDB\n\n#Note:- Candidate must be active and have creative technical ideas\n\nNeed to develop and handle multiple projects of company\nWeb development, application development as well as designing.\n\nLocation Pune District\nFirst preference Pune city"
    },
    {
        "Job No": "42",
        "Title": "Social Media Marketing Specialist",
        "Job Page Link": "https://upwork.com/job/Social-Media-Marketing-Specialist_~01ae276d2cdef8e53c/",
        "Posted": "3 hours ago",
        "Type": "Ongoing project",
        "Level": "Entry level",
        "Estimated Time": "More than 6 month",
        "Skill": "Social Media Management Jobs",
        "Detail": "Social Media Specialists are responsible for planning, implementing and monitoring the company's Social Media strategy in order to increase brand awareness, improve Marketing efforts and increase sales.  We are looking for an experienced and creative Social Media Specialist to join our team. As a Social Media Specialist, you will be responsible for developing and implementing our Social Media strategy in order to increase our online presence and improve our marketing and sales efforts.\n\nJob duties and responsibilities\n\nDevelop, implement and manage our social media strategy\nDefine most important social media KPIs\nManage and oversee social media content\nMeasure the success of every social media campaign\nStay up to date with the latest social media best practices and technologies\nUse social media marketing tools such as Buffer\nMonitor SEO and user engagement and suggest content optimization\nCommunicate with industry professionals and influencers via social media to create a strong network\nProvide constructive feedback\n\nJob requirements and qualifications\n\n1-2+ years of experience as a Social Media Specialist or similar role\nSocial Media Strategist using social media for brand awareness and impressions\nExcellent knowledge of Facebook, Twitter, LinkedIn, Pinterest, Instagram, and other social media best practices\nUnderstanding of SEO and web traffic metrics\nExperience with doing audience and buyer persona research\nGood understanding of social media KPIs\nExcellent multitasking skills\nCritical thinker and problem-solving skills\nTeam player\nGood time-management skills\nGreat interpersonal and communication skills\nDegree or certification in Social Media Marketing is a plus"
    },
    {
        "Job No": "43",
        "Title": "Need exp Worpdpress, Plugin API, (JS, PHP, HTML) Webite Developer",
        "Job Page Link": "https://upwork.com/job/Need-exp-Worpdpress-Plugin-API-PHP-HTML-Webite-Developer_~01ee278564130a8752/",
        "Posted": "3 hours ago",
        "Type": "One-time project",
        "Level": "Expert",
        "Estimated Time": "No Data",
        "Skill": "Landing Page Jobs",
        "Detail": "Looking for somone exp with wordpress. (Extensive Exp)\nLooking for somone exp with API's. (Extensive Exp)\nLooking for somone exp with Paypal\nLooking for somone exp with (Front End programming language)"
    },
    {
        "Job No": "44",
        "Title": "Website Developer",
        "Job Page Link": "https://upwork.com/job/Website-Developer_~010f42804901fda5bd/",
        "Posted": "3 hours ago",
        "Type": "One-time project",
        "Level": "Entry level",
        "Estimated Time": "No Data",
        "Skill": "Web Design Jobs",
        "Detail": "Develop and design a SINGLE page website and landing page.  All graphic images (Cover, landing, Logos, banners, ads, icons) will be provided in a zip file and your assignment is to use images provided to frame an epic website—to be better than our competitors:\n\nhttps://www.doordash.com/\n\nSee attachment for website layout."
    },
    {
        "Job No": "45",
        "Title": "Frontend Designer Developer Magento2",
        "Job Page Link": "https://upwork.com/job/Frontend-Designer-Developer-Magento2_~0160240fda0ec09f62/",
        "Posted": "3 hours ago",
        "Type": "Ongoing project",
        "Level": "Intermediate",
        "Estimated Time": "3 to 6 month",
        "Skill": "Web Design Jobs",
        "Detail": "Description: We’re looking for someone to take a role in ongoing design and frontend development over a range of different websites, for desktop and mobile usage. This will involve:\n\nUpdating existing sites and ongoing development to keep refreshed\nCreating landing pages and supporting ongoing and new campaigns, as well as designing email / social posts where necessary\nTake lead role in designing new B2C and B2B websites, whilst fitting in with existing design guidelines\nUnderstanding and complementing existing SEO Efforts\nWorking with both the internal Marketing and IT team to deliver complex and integrated projects.\n\nRequirements of Applicant\nExperience in frontend web technologies\nExperience with Adobe creative suite (or similar) for page mockups & design\nFamiliarity with backend languages, and ability to run development environments for large / complex projects\nAbility to work with marketing team to generate page designs, receive and take on board stakeholder feedback, and develop frontend\nAbility to delegate and manage offsite resource to assist delivering projects on time, under budget\nExperience with development for mobile and desktop environments.\n\nAbout Us\nWe're a Wanganui, NZ group of companies investing heavily in digital transformation, and wanting to provide to our clients the best online platforms. Our culture is second to none, and our staff come to work every day with a relentless focus on creating customer value. Our dedicated internal IT team leverage relationships with on & offshore developers, and work with local agencies to expedite delivery.\n\nWe prefer an applicant who can work onsite (Wanganui office), but also open to working with a remote worker. This is initially a part time job, with a view to increasing to fulltime.\n\nIf you're interested in gaining experience in varied markets, working with engaging and proactive people, joining a market leading team, and accelerating your career, send us your CV, Cover Letter, and a catalogue of your work."
    },
    {
        "Job No": "46",
        "Title": "UI/UX Design and Front-End Web Application Development",
        "Job Page Link": "https://upwork.com/job/Design-and-Front-End-Web-Application-Development_~012b2df00c946a554e/",
        "Posted": "3 hours ago",
        "Type": "One-time project",
        "Level": "Intermediate",
        "Estimated Time": "No Data",
        "Skill": "Web Application Jobs",
        "Detail": "Please read the entire post before applying.\n\nWe have a web application that includes a dashboard, project management and CRM features. We are looking for someone to redesign the UI/UX experience including front-end development.\n\nThe current version should provide you the necessary logic and requirements. Your job is to make it look modern and provide a great user experience.\n\nThis job requires UI design, UX design and front-end development. We prefer hiring one person for everything however we are willing to consider an offer with two people working together if necessary and if the rate is reasonable.\n\n\nREQUIRED:\nWe are only accepting applicants with proven and demonstrable experience. Please include links and/or screenshots to your past development experience.\n\nWe are not looking for someone to just write code. Successful applicants must have a very strong understanding of the user experience."
    },
    {
        "Job No": "47",
        "Title": "Develop iOS and Web app to display real time forest fire mapping.",
        "Job Page Link": "https://upwork.com/job/Develop-iOS-and-Web-app-display-real-time-forest-fire-mapping_~01471bfdee3ed54e59/",
        "Posted": "3 hours ago",
        "Type": "Ongoing project",
        "Level": "Expert",
        "Estimated Time": "Less than 1 month",
        "Skill": "Android Jobs",
        "Detail": "Deliver an iOS and Android app that would display real time fire mapping.\n\nThe app will display KMZ files.  Simple."
    },
    {
        "Job No": "48",
        "Title": "I need web page with idea similar to www.milliondollarhomepage.com",
        "Job Page Link": "https://upwork.com/job/need-web-page-with-idea-similar-www-milliondollarhomepage-com_~0175b199efe38a178a/",
        "Posted": "3 hours ago",
        "Type": "Ongoing project",
        "Level": "Intermediate",
        "Estimated Time": "Less than 1 month",
        "Skill": "Custom PHP Jobs",
        "Detail": "I need web page with idea similar to www.milliondollarhomepage.com"
    },
    {
        "Job No": "49",
        "Title": "Developer needed for iPhone and Android application",
        "Job Page Link": "https://upwork.com/job/Developer-needed-for-iPhone-and-Android-application_~01af79e32463371302/",
        "Posted": "3 hours ago",
        "Type": "Ongoing project",
        "Level": "Expert",
        "Estimated Time": "1 to 3 month",
        "Skill": "Phone Jobs",
        "Detail": "Looking for iPhone and Android developer who can integrate UI with Machine learning (Tensor flow) and Video processing."
    },
    {
        "Job No": "50",
        "Title": "Expert React & React Native Developer",
        "Job Page Link": "https://upwork.com/job/Expert-React-amp-React-Native-Developer_~018eec542bf29f892d/",
        "Posted": "3 hours ago",
        "Type": "Complex project",
        "Level": "Expert",
        "Estimated Time": "No Data",
        "Skill": "API Jobs",
        "Detail": "We are looking for React Native developers-\n\nResponsibility:\n\n1) Building user friendly Android and iOS Apps on React Native platform.\n\n2) Designing state-less components in React Native. State management with any of Redux, mobX or Flux.\n\n3) Writing modular, reusable, maintainable, well documented and fully tested code.\n\n4) Converting designs to mobile applications.\n\n5) Integrating with Rest APIs, while collaborating with Backend deve.\n\n6) Take complete ownership of the apps and change various elements/ technologies as per business need.\n\n7) Ensure optimum speed, performance, quality and responsiveness of application.\n\nRequired:\n\n1) Bachelor's Degree in Computer Science or related field from premier college.\n\n2) 2+ years of rich experience in React Native.\n\n3) Exceptional knowledge of Android and iOS design principles and interface guidelines.\n\n4) Hands-on experience on React Native APIs, Reactjs, Javascript, ECMAscript (OOJS) and JXS / TSX.\n\n5) Experience with offline storage, threading and Performance tuning.\n\n6) A user centric mentality for building product.\n\n7) Excellent understanding of stylesheets and responsive styling.\n\n8) Strong analytical skills and ability to assist team members in solving complex problems, inside and outside of engineering.\n\n9) Should be passionate about UI/UX of a product"
    },
    {
        "Job No": "51",
        "Title": "Website Designer focused on UX / UI and Strategic Development",
        "Job Page Link": "https://upwork.com/job/Website-Designer-focused-and-Strategic-Development_~01b6bc440f175cdd5a/",
        "Posted": "4 hours ago",
        "Type": "One-time project",
        "Level": "Intermediate",
        "Estimated Time": "No Data",
        "Skill": "Wireframes Jobs",
        "Detail": "We are seeking a website designer that can assist our team in developing a single page website design from our wireframe. You will be designing a page that will help drive traffic to different tours and activities in each state. You will create a plan to clearly showcase the activities we offer in a manner that allows for easy digestion of information and maximum conversion. We are seeking a minimalist and professional design.\n\nExpertise:\n- Mobile-friendly site experience\n- Must present designs in Figma\n\nPlease note: This is not a Wordpress site, and designer will be providing designs to in-house web developers."
    },
    {
        "Job No": "52",
        "Title": "Website Construction",
        "Job Page Link": "https://upwork.com/job/Website-Construction_~017d2a0c9105ea0d99/",
        "Posted": "4 hours ago",
        "Type": "One-time project",
        "Level": "Intermediate",
        "Estimated Time": "No Data",
        "Skill": "Website Development Jobs",
        "Detail": "We are a homewares company operating worldwide\n\nI need a complete website built including\nsupport for multiple countries(10 to begin) with shopping carts.\nNeed to serve both retail and wholesale clients.\nProducts would need to be able to be made active or inactive\nfor different countries.\nNeed to be location responsive - so if in Japan the Japan site defaults.\nI need full unlocked source files supplied and complete install instructions.\n\nWould like a price to build on either a platform like CS-cart or wordpress.\n\nPlease feel free to ask for more information."
    },
    {
        "Job No": "53",
        "Title": "Emoji PHP Function",
        "Job Page Link": "https://upwork.com/job/Emoji-PHP-Function_~0114e8e66bcd4da5e2/",
        "Posted": "4 hours ago",
        "Type": "One-time project",
        "Level": "Intermediate",
        "Estimated Time": "Less than 1 month",
        "Skill": "Web Application Jobs",
        "Detail": "We have a comment section in our web application where comments can be submitted. When the comment has been submitted, we would like symbols such as :) and :( to be converted to emoticons.\n\nI have found a class function file but it's not converting the entire string as a PHP explode function is not adequate enough as it's not picking up the characters that have been joined together. For example:\n\n:):):) - note no space\n\nBut it's picking up:\n:) :) :)\n\nI need a PHP function to be developed so we can send the text to the function so we can store the output into a MySQL table."
    },
    {
        "Job No": "54",
        "Title": "NYC-based Fintech Start-up looking for tech savvy part-timer",
        "Job Page Link": "https://upwork.com/job/NYC-based-Fintech-Start-looking-for-tech-savvy-part-timer_~01817fd904323f8e26/",
        "Posted": "4 hours ago",
        "Type": "Ongoing project",
        "Level": "Intermediate",
        "Estimated Time": "3 to 6 month",
        "Skill": "Java Jobs",
        "Detail": "VestedGlobal is a technology-driven investment platform based in NYC. We aim to fundamentally change the way we invest in the financial market. We defy one-size-fits-all investment offerings that are too prevalent in today's world and believe that investing should be easy, rewarding, and fun for anyone. We are an early-stage company looking for talent to help us develop our investment algorithms, websites, go-to-market strategies, and other tasks.\n\nIdeal candidates should have experiences in the following:\n\n- Java/Spring (Optionally: Python/Django)\n- SQL for designing and connecting to the database\n- React (Optionally: Redux also) for making interactive UI\n- JavaScript\n- AWS Services (S3)\n- Mobile Development\n- Familiarity with fintech landscape (Robinhood, Wealthfront, etc)\nWe are a young and entrepreneurial group truly believes in building a differentiated product and hope you can be a part of us. Although this role is advertised as part-time, we hope to find the right fit to grow into the role for the long run and be a part of our success."
    },
    {
        "Job No": "55",
        "Title": "Lead Generation for a new SaaS company targeting Shopify merchants",
        "Job Page Link": "https://upwork.com/job/Lead-Generation-for-new-SaaS-company-targeting-Shopify-merchants_~0100b4e93a92d76a62/",
        "Posted": "4 hours ago",
        "Type": "Ongoing project",
        "Level": "Intermediate",
        "Estimated Time": "More than 6 month",
        "Skill": "Appointment Setting Jobs",
        "Detail": "We are a SaaS company offering a same-day delivery solution to Shopify merchants in Toronto.\n\nWe have a list of merchants that we would like to reach out to in order to pitch our app to them and we need someone to take care of reaching out and setting appointment. If the right candidate can also sell and close deals for us, we are happy to pay a generous commission for every Shopify stores that are onboarded onto our app.\n\nThe ideal candidate should have Lead Generation experience, ideally within the eCommerce software space. Sales experience and familiarity with Shopify is definitely also a bonus but not a must."
    },
    {
        "Job No": "56",
        "Title": "Shopify Website Development/Optimization",
        "Job Page Link": "https://upwork.com/job/Shopify-Website-Development-Optimization_~01e8e621d0fd72412d/",
        "Posted": "4 hours ago",
        "Type": "One-time project",
        "Level": "Intermediate",
        "Estimated Time": "No Data",
        "Skill": "Website Jobs",
        "Detail": "We are looking for a website developer who has experience using shopify templates and coding to help build out our new website. One of the important skills we are looking for is also having experience with website optimization to help our conversion rate. Graphic design experience is also a plus. Here is our existing website:\n\nwww.varavasa.com"
    },
    {
        "Job No": "57",
        "Title": "WebGL three js Canvas - process and edit vector files tool",
        "Job Page Link": "https://upwork.com/job/WebGL-three-Canvas-process-and-edit-vector-files-tool_~01b0bae8368e69a388/",
        "Posted": "4 hours ago",
        "Type": "One-time project",
        "Level": "Entry level",
        "Estimated Time": "No Data",
        "Skill": "Web Application Jobs",
        "Detail": "we need web tool to import various vector files ex DXF, DWG, PLT, AI, CRD, SVG then detect closed loop lines and identify them as \"part\" and the nest them to specific plane  as much as we can and finally export back nested and individual files along with calculating total vector length.\nThats short description, little more detailed in PDF attached,\n\nI think most easiest way to do this is in Three JS  but other options are possible, ex google canvas sample can be good starting point\n\nthis is test task, when its done we will need to turn this to full scale tool\n\nplease show your previsions with webgl, thee or ant other related environments"
    },
    {
        "Job No": "58",
        "Title": "Webrtc developer for web app",
        "Job Page Link": "https://upwork.com/job/Webrtc-developer-for-web-app_~0194239d098cdfe7ab/",
        "Posted": "4 hours ago",
        "Type": "One-time project",
        "Level": "Expert",
        "Estimated Time": "No Data",
        "Skill": "Database Architecture Jobs",
        "Detail": "we have requirement of webrtc developer. who has expirence with video calling, voice calling, with webrtc and libaray of JsSIP. We need extra feaures like store the recording , create room for specific time slots and users can talk with each other. Only 2 person can talk at time.\n\ntype \"JsSIP\" in middle of proposal.so, i can understand you are not bot.\n\nLibrary refrence link :- http://tryit.jssip.net/"
    },
    {
        "Job No": "59",
        "Title": "Deploy Laravel App and Hook up 3 Mobile Apps",
        "Job Page Link": "https://upwork.com/job/Deploy-Laravel-App-and-Hook-Mobile-Apps_~01126627cf71843d2c/",
        "Posted": "4 hours ago",
        "Type": "One-time project",
        "Level": "Intermediate",
        "Estimated Time": "No Data",
        "Skill": "Web Application Jobs",
        "Detail": "Description:\nI have the source code for an Instacart/Deliveroo clone composed of a PHP+Laravel Web app and three android apps. The goal of this project is to deploy the platform and have three mobile apps interface with it.\n\nMobile side has 3 android apps: User, store, and driver.\nAPI's: The platform uses a number of API's related to location, driver directions, google place for autocomplete, static maps, etc.\n\nAfter deployment of the Web App, Android Apps need to be hooked up to all the necessary google, firebase API's.\n\nPlease refer to the documents attached for a thorough representation of the deliverables.\n\nDeliverables:\n1) Deploy the platform using Cloudways, Google Cloud and Firebase\n2) Upload android apps to Firebase.\n2) Make the necessary url and api changes to the  apps for them to interface correctly.\n3) Enable all the necessary API's to make the apps and platform work as intended.\n4) Must hand over modified source code for the 4 apps through provided github repo as collaborator."
    },
    {
        "Job No": "60",
        "Title": "Website Design",
        "Job Page Link": "https://upwork.com/job/Website-Design_~01cd4b73ca907e6f3b/",
        "Posted": "4 hours ago",
        "Type": "One-time project",
        "Level": "Intermediate",
        "Estimated Time": "No Data",
        "Skill": "Components Design Jobs",
        "Detail": "I am looking for one person to work with me in developing an interactive website including e-commerce, and a landing page."
    },
    {
        "Job No": "61",
        "Title": "Deploy Laravel App and Hook up 3 Mobile Apps",
        "Job Page Link": "https://upwork.com/job/Deploy-Laravel-App-and-Hook-Mobile-Apps_~01126627cf71843d2c/",
        "Posted": "4 hours ago",
        "Type": "One-time project",
        "Level": "Intermediate",
        "Estimated Time": "No Data",
        "Skill": "Web Application Jobs",
        "Detail": "Description:\nI have the source code for an Instacart/Deliveroo clone composed of a PHP+Laravel Web app and three android apps. The goal of this project is to deploy the platform and have three mobile apps interface with it.\n\nMobile side has 3 android apps: User, store, and driver.\nAPI's: The platform uses a number of API's related to location, driver directions, google place for autocomplete, static maps, etc.\n\nAfter deployment of the Web App, Android Apps need to be hooked up to all the necessary google, firebase API's.\n\nPlease refer to the documents attached for a thorough representation of the deliverables.\n\nDeliverables:\n1) Deploy the platform using Cloudways, Google Cloud and Firebase\n2) Upload android apps to Firebase.\n2) Make the necessary url and api changes to the  apps for them to interface correctly.\n3) Enable all the necessary API's to make the apps and platform work as intended.\n4) Must hand over modified source code for the 4 apps through provided github repo as collaborator."
    },
    {
        "Job No": "62",
        "Title": "Website Design",
        "Job Page Link": "https://upwork.com/job/Website-Design_~01cd4b73ca907e6f3b/",
        "Posted": "4 hours ago",
        "Type": "One-time project",
        "Level": "Intermediate",
        "Estimated Time": "No Data",
        "Skill": "Components Design Jobs",
        "Detail": "I am looking for one person to work with me in developing an interactive website including e-commerce, and a landing page."
    },
    {
        "Job No": "63",
        "Title": "Desktop Software Development",
        "Job Page Link": "https://upwork.com/job/Desktop-Software-Development_~01ef0150175057b097/",
        "Posted": "4 hours ago",
        "Type": "Complex project",
        "Level": "Expert",
        "Estimated Time": "More than 6 month",
        "Skill": "No Data",
        "Detail": "Create a Web based operating system for the forwarding industry. It should be firm but also flexible to adjust by country requirements. Shipment details have to be entered or can be received by EDI from shipper or consignee. Link to carriers, link to customs and has to include the accounting and financial part as well to be able to bill customers.\nThe system should be able to work for Airfreight, Oceanfreight, Customs, Road freight, Logistics, etc"
    },
    {
        "Job No": "64",
        "Title": "Laravel / Vue.js Developer for SaaS",
        "Job Page Link": "https://upwork.com/job/Laravel-Vue-Developer-for-SaaS_~0146da9e29b7f90910/",
        "Posted": "4 hours ago",
        "Type": "Ongoing project",
        "Level": "Intermediate",
        "Estimated Time": "1 to 3 month",
        "Skill": "Vue.js Jobs",
        "Detail": "We are looking for an additional senior Vue.js & Laravel Developer to join a vibrant Dutch startup. We are building a beautiful SaaS with the amazing Laravel PHP and VueJS Frameworks. We are looking for a great full stack web developer that knows these frameworks well.\n\nYou will be needing to help out with finishing the MVP and take care of the following:\n\n- Integrate e-boekhouden.nl bookkeeping SOAP / XML) - https://github.com/innovato/eBoekhoudenApi or Moneybird\n- Subscription package tweaks including sales / discounts (Laravel PHP)\n- Debug Vue/JS issues\n- Improve GUI Multiple modals (Vue components, JS modules and Bootstrap)\n- Modules - Create new modules using existing specs with additions\n- Migrate from TinyMCE 4 to CKEditor 5 https://imwz.io/tinymce-4-migration-to-ckeditor-5/\n\nSkills:\n\nFrontend Development\n- VueJS\n- VueX\n- CKEditor\n- Vanilla JavaScript - ES6\n- Laravel Dusk\n\nBackend Development\n- Laravel PHP 6+ and al that comes with it\n- Multiple Laravel and PHP Packages: Backup, Doorman, Media Manager, Intervention, Horizon, Laravel Mollie, Laravel Newsletter\n- Laravel Cashier\n- Mollie API\n- TransIP API\n\nDevOps\n- PHP Deployer\n- Digital Ocean LEMP / MariaDB / Spaces / Volumes\n- Laravel Forge\n- Kubernetes\n- Terraform\n- Github\n- Let's Encrypt"
    },
    {
        "Job No": "65",
        "Title": "Create a web crawler to find and organize contact details of professionals from the internet",
        "Job Page Link": "https://upwork.com/job/Create-web-crawler-find-and-organize-contact-details-professionals-from-the-internet_~013b158284954e3980/",
        "Posted": "5 hours ago",
        "Type": "Ongoing project",
        "Level": "Expert",
        "Estimated Time": "1 to 3 month",
        "Skill": "No Data",
        "Detail": "Develop a prototype that can find telephone numbers (ideally cell/mobile) as well as e-mails"
    },
    {
        "Job No": "66",
        "Title": "Wordpress Pro To Re-Design, Clean, Modernize, A Mobile Friendly Wordpress Site",
        "Job Page Link": "https://upwork.com/job/Wordpress-Pro-Design-Clean-Modernize-Mobile-Friendly-Wordpress-Site_~01716fdab2e3ad8495/",
        "Posted": "5 hours ago",
        "Type": "One-time project",
        "Level": "Intermediate",
        "Estimated Time": "No Data",
        "Skill": "Information Architecture Jobs",
        "Detail": "I am looking for a skilled designer to clean up my wordpress site. Modernizing it, simplifying with more design and less words. Mobile friendly. If you feel like you are up for the job, I don't think it would take long for a skilled professional. Depending, if you know how to build learning platforms as well, but website is urgent, so I can feel confident starting my marketing campaigns and them landing on any page. SEO optimized for ranking. I have yoast installed and many other plugins. https:///www.reslifemgmt.com to get ideas."
    },
    {
        "Job No": "67",
        "Title": "Front-End Development",
        "Job Page Link": "https://upwork.com/job/Front-End-Development_~0163f24d3382f86c0b/",
        "Posted": "5 hours ago",
        "Type": "One-time project",
        "Level": "Entry level",
        "Estimated Time": "No Data",
        "Skill": "HTML Jobs",
        "Detail": "Hi already have the website built by a previous developer. Just need someone to create some tooltip features along with collapsible sections. Content will be provided for the tooltip texts.\nThis should be a fairly quick job."
    },
    {
        "Job No": "68",
        "Title": "Web developer and business consultant for real estate investments",
        "Job Page Link": "https://upwork.com/job/Web-developer-and-business-consultant-for-real-estate-investments_~01a0badce918c0cf8e/",
        "Posted": "5 hours ago",
        "Type": "Ongoing project",
        "Level": "Expert",
        "Estimated Time": "1 to 3 month",
        "Skill": "Real Estate Jobs",
        "Detail": "Need assistance building a real estate investment business, web design, and business modeling and consulting.  Will describe in greater deal, this is a startup but could fall into a long term fixed opportunity"
    },
    {
        "Job No": "69",
        "Title": "We need to develop an Automatically record driving time and details application (Android and WEB)",
        "Job Page Link": "https://upwork.com/job/need-develop-Automatically-record-driving-time-and-details-application-Android-and-WEB_~018dc1e94c9752aecb/",
        "Posted": "5 hours ago",
        "Type": "Complex project",
        "Level": "Intermediate",
        "Estimated Time": "No Data",
        "Skill": "Phone Jobs",
        "Detail": "We need to develop an Automatically record driving time and details app (Android and WEB),\nWe call it the ELD system，It is basically the same as this APP, please download and test.\nhttps://play.google.com/store/apps/details?id=com.keeptruckin.android&hl=en\n\nThis video introduces the usage process, please check:\nhttps://youtu.be/qPzBzIm_OQQ\n\nThis APP must be certified by the US Department of Transportation, please work according to this development manual.\nhttps://eld.fmcsa.dot.gov/File/Index/ca3647f7-9d0b-4048-a5c3-466e49cb0946\n\n\nThere is only one milestone, and we hope you can start work next week."
    },
    {
        "Job No": "70",
        "Title": "Developer needed to integrate PayPal Subscription Service",
        "Job Page Link": "https://upwork.com/job/Developer-needed-integrate-PayPal-Subscription-Service_~011c980cf65ba679ef/",
        "Posted": "5 hours ago",
        "Type": "One-time project",
        "Level": "Intermediate",
        "Estimated Time": "No Data",
        "Skill": "API Integration Jobs",
        "Detail": "The project involves setting up PayPal subscription service to bill subscribers monthly.  It includes pausing the billing service, restarting the billing, and canceling the service. There will be web hooks back to the hosting website to record activities as necessary."
    },
    {
        "Job No": "71",
        "Title": "Home Page for SaaS Platform",
        "Job Page Link": "https://upwork.com/job/Home-Page-for-SaaS-Platform_~013d49fddabe1c37a9/",
        "Posted": "5 hours ago",
        "Type": "One-time project",
        "Level": "Intermediate",
        "Estimated Time": "No Data",
        "Skill": "Website Jobs",
        "Detail": "The project is to create a website for SaaS platform on HTML\nAfter home page is done we will add new tasks for inner pages."
    },
    {
        "Job No": "72",
        "Title": "Developers required for highly customize able E-Commerce Website for Furniture store",
        "Job Page Link": "https://upwork.com/job/Developers-required-for-highly-customize-able-Commerce-Website-for-Furniture-store_~014b6a9858f2b05478/",
        "Posted": "5 hours ago",
        "Type": "One-time project",
        "Level": "Intermediate",
        "Estimated Time": "No Data",
        "Skill": "Web Design Jobs",
        "Detail": "I want to create a e-commerce website with below features:\nLanding Page\nAdmin Console\nProduct Catalogs\nProduct information\nInventory Management\nCustomer Account Management\nPayment Gateways\nSSL\nResponsive Webdesign\nReturn Management\nBrand Management\nSocial Media export\nOrder Management\nDelivery Management\nVendor Management\nMulti Store Management\nGoogle Analytics Integration\nFavicon\nSEO\nContact us\nNon Functional requirements\nHosting\nSearch Optimizer\n\nI am looking for a individual freelancer to work on my project and should be able to deliver the website in Agile with agreed product backlog and delivery timeline for each feature."
    },
    {
        "Job No": "73",
        "Title": "An agency needed for a small healthcare project.",
        "Job Page Link": "https://upwork.com/job/agency-needed-for-small-healthcare-project_~01b7b6f0a05b1b48c3/",
        "Posted": "5 hours ago",
        "Type": "Ongoing project",
        "Level": "Expert",
        "Estimated Time": "1 to 3 month",
        "Skill": "Web Application Jobs",
        "Detail": "PLEASE READ CAREFULLY BEFORE APPLYING.\n\nWe are looking for developers for a healthcare project. Our system consists of 4 parts:\n\n1) Reservation (rendez-vous) system to book appointments with doctors.\n2) Core healthcare system, doctors, patients, illnesses, prescriptions, medicines, medical imaging and patients medical history.\n3) Remote consultations through video calls, using Twillio or ChatBox SDKs.\n4) Medical dashboard for doctors to check all the stats of their patients.\n\nPlease notice that the backend must be fully built on Microservices architecture that we already designed. Each MS must have its own DB.\n\nBackend must be built on springboot over kotlin and gradle, where the web is developed on angular.\n\nArchitetre has been already designed."
    },
    {
        "Job No": "74",
        "Title": "Clickbank Setup Specialist with HTML, developer, CB technical skills to Establish Turnkey Projects",
        "Job Page Link": "https://upwork.com/job/Clickbank-Setup-Specialist-with-HTML-developer-technical-skills-Establish-Turnkey-Projects_~0148d56f5740ccde21/",
        "Posted": "5 hours ago",
        "Type": "One-time project",
        "Level": "Intermediate",
        "Estimated Time": "No Data",
        "Skill": "Web Design Jobs",
        "Detail": "I have four projects that I would like to get setup for Clickbank.  Each project consists of 2 web pages and an ebook.  The web pages have links to payment and e-newsletter subscription.  The web pages already have the sales letter written.\n\nThe candidate will take the components of each project and edit to adhere to Clickbank’s policies such as CB badge, links to ordering, etc.\n\nIn other words, the candidate will take the files provided and modify/edit and then upload to the hosting site.  The hosting sites are already established along with domain names.\n\n1) Files are provided which serves as the components of the project.\n\n2) The candidate will need to possess skills such as html editing, file transfers to hosting site, Clickbank protocols and requirement\n\n3) There are four projects – all same in structure\n\n4) Ensure the web pages are mobile and multi device friendly\n\n5) The Upwork contract is considered complete when all four projects are up and running (no limits on editing/correcting of projects.\n\nRestated - Project in job post includes the four website projects.  There are no limits to edits.  In other words, a job is complete when all edits, corrections, and sites are running."
    },
    {
        "Job No": "75",
        "Title": "Looking for a front-end and back-end developer (two people) to design a digital retail store.",
        "Job Page Link": "https://upwork.com/job/Looking-for-front-end-and-back-end-developer-two-people-design-digital-retail-store_~019966b87986f05e8c/",
        "Posted": "5 hours ago",
        "Type": "Ongoing project",
        "Level": "Expert",
        "Estimated Time": "1 to 3 month",
        "Skill": "Web Design Jobs",
        "Detail": "We are looking for two developers to create a digital retail website, we need one front-end and one back-end developer. We do not have necessarily have a vision (aesthetically) for this website, so developers most be creative enough to draw from the foundation ideas we present them with.\n\nOur project: Our company is starting an online retail store that will start out by selling primarily hardware. We are already building up stock in our warehouse, but one of our top priorities is to get the website started. To be completely honest, we don't have an accurate vision of how our website will look, and don't know all of the small functionalities it will include. We need someone that can work with us a little and take some control because we have a lot of other logistics and time consuming tasks that we need to manage. With that said, we are trying to make a top quality website with tons of automation and modeled similarly to other competitors like Home Depot and Amazon."
    },
    {
        "Job No": "76",
        "Title": "Website Design for blogging",
        "Job Page Link": "https://upwork.com/job/Website-Design-for-blogging_~0187c592bb589b6d84/",
        "Posted": "5 hours ago",
        "Type": "Ongoing project",
        "Level": "Entry level",
        "Estimated Time": "No Data",
        "Skill": "Responsive Design Jobs",
        "Detail": "I need Simple But cretive website for my Blogger Chanelwhich include home page with data base link   admin panel for post blog  seo friendly mobile compatible\nSample site\nTraveltrangle.com\nPlanetware.com"
    },
    {
        "Job No": "77",
        "Title": "Upgrade my VoIP platform to create a scheduling tool",
        "Job Page Link": "https://upwork.com/job/Upgrade-VoIP-platform-create-scheduling-tool_~0151a682c66265e373/",
        "Posted": "5 hours ago",
        "Type": "Ongoing project",
        "Level": "Expert",
        "Estimated Time": "No Data",
        "Skill": "API Jobs",
        "Detail": "I have a VOIP platform called pvaline.com written in codeignitor. It's not made very well but the things it's meant to do it does.\n\nI want to make a\n- scheduling\n- sms reminders and confirmation\nand you could use pvaline as base to modify it in order to support these 2 main functions\n\nThis will be an application for a handyman to\n-send link to the customer so they can schedule a service call to make repairs in the customers home\n-the app will allow the customer to schedule or handyman can schedule for customer\n-in-app COVID notifications and SMS notification content must be same as provided in the video links below\n-flow same as video\n-SMS reply trigger and content the same also\n\nOne of the videos shows AT&T function, however this is only an example of how AT&T did it. I don't want to copy all their UI and their internet related content. You don't need to show speedtest testing, and other intent related language and flow, the application I want should be general\n\n(link removed)\n\nEach handyman company needs to have a unique link, as calandly.com does for users.\n\nBelow is one more video to show how registration should look for a handyman. Simple and create a unique calendar link.\n\n(link removed)\n\nIs this something you can do in 2-3 days?\n\nPVAline.com already has payment gateway, receipt function, database setup for users, billing, it's a functioning site that needs a few more features. It does not have recurring billing setup. Also, the database in the app has dependencies to another platform, so don't change the db structure. If you need to build anything, build additional tables for calendar and SMS. I can give you access to the repo so you can review."
    },
    {
        "Job No": "78",
        "Title": "Virtual Asst. Marketing & Social Media Intern - PAID INTERNSHIP New to Upwork? Build Upwork History!",
        "Job Page Link": "https://upwork.com/job/Virtual-Asst-Marketing-amp-Social-Media-Intern-PAID-INTERNSHIP-New-Upwork-Build-Upwork-History_~01b44b7fca1fb0d8df/",
        "Posted": "5 hours ago",
        "Type": "Ongoing project",
        "Level": "Entry level",
        "Estimated Time": "No Data",
        "Skill": "Virtual Jobs",
        "Detail": "AWESOME PAID INTERNSHIP!!! LEARN & EARN AT THE SAME TIME, AND BUILD YOUR CAREER IN UPWORK!\n\nRead Carefully >> \"This is such a great internship that most often, our interns go on to accept great (well-paid) freelance and local jobs because of the experience gained here!\" We're a highly ranked employer in Upwork, and are excited to take on some new interns to develop. Could the next person be you?\n\nTHIS IS A FIXED PRICE FOR THE FULL MONTH NOT HOURLY -  READ THE SPEC IN FULL.\n\nGREAT JOB FOR SOMEONE WHO HAS GOOD ENGLISH COMMUNICATION SKILLS, ** IS RELIABLE ** AND WANTS TO BUILD UP THEIR UPWORK PROFILE.\n\nThis is a really exciting position for someone serious about becoming a marketing & social media expert in the future for clients and building a great freelancing career. The job is varied and suits someone who has a great attitude and is passionate about learning. We have a worldwide team and are adding to that. We are looking for three more staff who are great at web research and social media activities to be on our exciting team. You will be given interesting exciting projects to fill and work as part of a team. Think of this role as a kind of internship with a modest compensation but the chance to do a LOT of different things that help you gain experience to improve your freelancing career. We're an Upwork 5 star employer, our team are well trained and gain a wealth of experience working on the team.\n\nWe'd need at least a commitment of 6 months. Please apply if you are looking for something you can commit to, as we spend a lot of time training and guiding you to do these amazing social media things you can continue to gain value from long after you've moved on to brighter things :)\n\nDuties include:\n- working on marketing campaigns for clients all over the world. Build real world experience\n- let us know things you are keen to learn and skills you want to develop and we'll try to incorporate them in your role so you have real-life experience of it.\n- social media research on Twitter and Instagram\n- social media tasks in all different aspects\n- marketing tasks for real clients to build your experience\n- admin tasks that require attention to detail\n- replying to people on social media like twitter/facebook etc.\n- sending emails/messages to selected companies/people with our offers\n- some admin tasks/ email support / live chat\n- web and social media research\n- following and unfollowing on multiple twitter accounts\n- Instagram activities\n- some other social media activities\n- general data entry\n- finding and uploading content images etc.\n- and more\n\n\nTRAINING provided on most things but you need to be able to work well alone. We have a phenomenal training and support program for newbies.\n\nARE YOU A TEAM PLAYER? DO YOU WANT TO START A NEW CAREER WITH A VIBRANT COMPANY? THIS COULD BE THE OPPORTUNITY YOU'VE BEEN HOPING FOR!\n\nThis is a good job/internship for someone who has some time every day to get professional work done, wants to build up their upwork history, and can start immediately. You have to have good research and social media skills, don't get bored easily, be good at following instructions and have experience finding resources to use for businesses (even your own).  \n\nIMPORTANT\n\nTo show me you actually read this application thoroughly and have good attention to detail please tell me what is the colour of the ocean first in your covering letter. You'd be surprised how many people don't read fully, and this shows us that they wouldn't be great on this job which requires attention to detail.\n\nWe have a great team, and we're looking for 2-4 people who can be with us for the long term. If you do well, you may be given other jobs with our company too."
    },
    {
        "Job No": "79",
        "Title": "Wix Designer",
        "Job Page Link": "https://upwork.com/job/Wix-Designer_~019359667f213ca71c/",
        "Posted": "5 hours ago",
        "Type": "One-time project",
        "Level": "Intermediate",
        "Estimated Time": "No Data",
        "Skill": "Landing Page Jobs",
        "Detail": "Looking for a designer to work on an existing website built on Wix.\nLook and feel of website has already been set. 12 pages in total."
    },
    {
        "Job No": "80",
        "Title": "Need Android and IOS developer for several projects",
        "Job Page Link": "https://upwork.com/job/Need-Android-and-IOS-developer-for-several-projects_~01edb2980fa2be6de4/",
        "Posted": "5 hours ago",
        "Type": "One-time project",
        "Level": "Expert",
        "Estimated Time": "1 to 3 month",
        "Skill": "Phone Jobs",
        "Detail": "Good morning,\n\nI'm a web developer. Currently I have mobile application and website development projects to realize. I can't do them all because I'm currently working on other projects. So I would like to work with IT developers or agencies that can develop these different IT projects.\n\nWhat I'm looking for is professionalism (project management, agile method etc...) and quality work. I've already worked with some developers and I'm not too happy with the final result.\n\nIf you want to share this adventure with me, contact me as soon as possible.\n\nSee you soon."
    },
    {
        "Job No": "81",
        "Title": "Web and Blog Development",
        "Job Page Link": "https://upwork.com/job/Web-and-Blog-Development_~017cab000597fb4a43/",
        "Posted": "5 hours ago",
        "Type": "One-time project",
        "Level": "Expert",
        "Estimated Time": "No Data",
        "Skill": "No Data",
        "Detail": "I am looking for a website for my commercial real estate consulting business.\n\nThe site should be fairly simple with a home page, about us, blog, portfolio, and contact us page.\n\nThe blog would be updated fairly often with my own writing. Portfolio would be a page with links to excel models and tableau graphs that I've put together.\n\nLogo files attached."
    },
    {
        "Job No": "82",
        "Title": "Game Development",
        "Job Page Link": "https://upwork.com/job/Game-Development_~014ce5a7432e2fbeb8/",
        "Posted": "5 hours ago",
        "Type": "Ongoing project",
        "Level": "Intermediate",
        "Estimated Time": "No Data",
        "Skill": "Phone Jobs",
        "Detail": "This project is a direct port of a successful PC game \"Avery Cardoza's 100 Slots\" into a phone app.  All of the beautiful artwork for forty different original slot machines is already created and perfected with nothing missing.  Also I have all the sounds, source code (C++), complete game design documentation, etc.  This should be a very easy game app to build.\n\nThe plan is to wrap all of this beautiful artwork and originality into a mobile app, which is monetized like a modern app: Rewards, Levels, Ads, Sell Play Money and/or features, etc.   This topic is open to discussion which method(s) are best.\n\nMany more details are here: http://tkweb.com/projects/cardoza-retro-slots/"
    },
    {
        "Job No": "83",
        "Title": "Hiring a rockstar ReactJS, NodeJS backend web dev",
        "Job Page Link": "https://upwork.com/job/Hiring-rockstar-ReactJS-NodeJS-backend-web-dev_~014e69b848dcc56716/",
        "Posted": "6 hours ago",
        "Type": "Ongoing project",
        "Level": "Expert",
        "Estimated Time": "No Data",
        "Skill": "RESTful API Jobs",
        "Detail": "Need help with react js and node js backend and front end task with MERN stack\nTo add to team of 5"
    },
    {
        "Job No": "84",
        "Title": "Web developer needed for an one-page WordPress site (personal resume)",
        "Job Page Link": "https://upwork.com/job/Web-developer-needed-for-one-page-WordPress-site-personal-resume_~0190d8522033349528/",
        "Posted": "6 hours ago",
        "Type": "One-time project",
        "Level": "Intermediate",
        "Estimated Time": "No Data",
        "Skill": "Website Jobs",
        "Detail": "I'm looking for a web developer that would help me create a minimalist responsive one-pager (might involve creating graphics).\n\nThis site is intended for me (a freelancer) to showcase my services and experience, and will include the following elements (might change later, but not drastically):\n\n- bio + photo\n- social icons\n- my services\n- my clients (logo)\n- testimonials\n- contact form\n\nTo give an example, this is the look and level of complexity I want:\n\nhttps://demo.goodlayers.com/onepagepro/cv/\nhttp://wpdemos.themezaa.com/brando/personal/\nhttps://demo.kallyas.net/digital-agency/\n\nThe most important thing to me is that the site looks great. You're free to install whatever theme you're comfortable with.\n\nOf course, I will provide you access to my Wordpress site. If you need access to anything else, please let me know ahead of time.\n\nThank you!"
    },
    {
        "Job No": "85",
        "Title": "Typescript developer for Serverless GraphQL API",
        "Job Page Link": "https://upwork.com/job/Typescript-developer-for-Serverless-GraphQL-API_~01d14a8b19b3661172/",
        "Posted": "6 hours ago",
        "Type": "Ongoing project",
        "Level": "Expert",
        "Estimated Time": "1 to 3 month",
        "Skill": "API Jobs",
        "Detail": "Our upcoming project involves building a serverless GraphQL API for some authenticated user content. This API is going to be implemented using Typescript + Jest + Serverless Framework (Node.JS) and a number of cloud-native backing services to create a loosely coupled set of microservices for multiple user-facing platforms.\n\nIn this project, we'd like to work closely with another developer full time, with availability during the day to discuss verbally any developments and questions about the project. As such, someone flexible to work according to an ACST timezone is preferable."
    },
    {
        "Job No": "86",
        "Title": "Develop Wordpress plugin",
        "Job Page Link": "https://upwork.com/job/Develop-Wordpress-plugin_~017532cd2c2225f74d/",
        "Posted": "6 hours ago",
        "Type": "One-time project",
        "Level": "Expert",
        "Estimated Time": "Less than 1 month",
        "Skill": "Website Jobs",
        "Detail": "Develop a Wordpress plugin to automate the use of web-based software."
    },
    {
        "Job No": "87",
        "Title": "Developer needed for SMS Customer Service web app",
        "Job Page Link": "https://upwork.com/job/Developer-needed-for-SMS-Customer-Service-web-app_~015a29401e2fe7e9f9/",
        "Posted": "6 hours ago",
        "Type": "One-time project",
        "Level": "Expert",
        "Estimated Time": "Less than 1 month",
        "Skill": "Twilio API Jobs",
        "Detail": "Looking for a developer with experience in SMS messaging applications (Twilio and similar messaging APIs).\n\nThe application will compliment a larger SMS platform we have developed. This portion will handle customer service through masked one-to-one messaging for multiple brands.\n\nHere's a link to documentation from Twilio of the main feature we need:\nhttps://www.twilio.com/docs/proxy/using-the-reserved-numbers-and-auto-create-functionalities-to-support-the-online-directory-scenarios\n\nOther features include:\n- Handling multiple unique Brands in one platform (separate and unique login and settings for each brand)\n- Automated welcome message\n- Save inbound customer as Contacts, and show a record of messages sent in platform\n\nStack:\n- AWS\n- Node.js\n- React (TBD)\n- Wordpress (TBD)"
    },
    {
        "Job No": "88",
        "Title": "Account Manager for eCommerce agency",
        "Job Page Link": "https://upwork.com/job/Account-Manager-for-eCommerce-agency_~01d86c4589ce4d4fea/",
        "Posted": "6 hours ago",
        "Type": "Ongoing project",
        "Level": "Entry level",
        "Estimated Time": "More than 6 month",
        "Skill": "eCommerce Jobs",
        "Detail": "North American Candidates Only Please! Priority is given to candidates in the EST time zone.\n\nWe are a startup eCommerce Development agency in downtown Toronto specializing on Shopify store and app builds.\n\nWe are looking for a full time Account Manager who is looking to work on Web Design and Development projects, ideally with Shopify and/or within a startup environment.\n\nThis job is 100% remote with some optional in-office time.\n\nThis position can quickly grow into a Senior position as we are a growing company looking for individuals who will help us in that growth.\n\nThis job is 100% remote with some optional in-office time.\n\nThis position can quickly grow into a Senior position as we are a growing company looking for individuals who will help us in that growth.\n\n- Communicate directly to clients about updates on their projects\n- Learn about Web development and Shopify\n- Facilitate discussions to create roadmap\n- Prototype product requirements\n- Prioritize backlog and customer feedback\n- Cultivate cross-functional team collaboration\n- Provide quality assurance on web projects\n- Measure product success\n- Onboard onshore and offshore team member\n- Manage scaled and pilot projects\n- Update project management tools with ongoing information from the team\n- Other tasks as required by CEO and Head of Service to grow startup businesses\n\nThe ideal candidate is a tech savvy problem solver with Startup experience, someone who is constantly looking to add new skills to their repertoire and that is hungry to keep learning and improving the company with us.\n\nShopify experience, definitely a bonus but not a must.\n\nIf you think you would be a good fit for this, please feel free to apply here."
    },
    {
        "Job No": "89",
        "Title": "Senior full stack developer (React, Node) for complex company site.",
        "Job Page Link": "https://upwork.com/job/Senior-full-stack-developer-React-Node-for-complex-company-site_~013f354f6a6b366d94/",
        "Posted": "6 hours ago",
        "Type": "Ongoing project",
        "Level": "Expert",
        "Estimated Time": "More than 6 month",
        "Skill": "API Jobs",
        "Detail": "We would like to develop a web application to control company website.\nWebsite is built using React.js, Node.js, MongoDB, Bootstrap 4, and RESTful API. We need someone who is an expert in these technologies. You will need to implement control panel on same stack with payment integration, time tracker and statistic gather.\n\nI need developer who has experience in developing such kind of work previously and will allot work to only those who have developed something similar in past.(I need to see demo of previous work to get the confidence).\nWe have to rebuild our site to professional MERN stack, so only super experts in this stack.\nWe will start asap, please share your perfect projects, explain detailed parts you have done, and start as new tech.\nIf you have super match with this stack, we will hire immediately, and have the long term project.\n\nThanks"
    },
    {
        "Job No": "90",
        "Title": "I need a wordpress developer to build a directory",
        "Job Page Link": "https://upwork.com/job/need-wordpress-developer-build-directory_~01d5332bc6d807d0a6/",
        "Posted": "6 hours ago",
        "Type": "One-time project",
        "Level": "Intermediate",
        "Estimated Time": "Less than 1 month",
        "Skill": "WordPress Jobs",
        "Detail": "This is a very simple task and if you want to use a plugin to complete it, that's 100% fine.  I don't care about the theme and I don't want a navigation menu.  I just want a white background with a search. and a couple filter options.  Region - State - City.  You can search and pull up results or if you just use the filters you will receive the appropriate results as well.\n\nI will need several fields for each directory result.\n\nLogo (image) Name - Region - State - City - Exits (text field) - Investments (text field) - Partners (paragraph field) - Verticles (drop down menu) - About (paragraph field)\n\nYou can click on a result and view the details.\n\nMust be 100% mobile compatible.  This is the full requirement"
    },
    {
        "Job No": "91",
        "Title": "Website redevelopment on WordPress with members portal",
        "Job Page Link": "https://upwork.com/job/Website-redevelopment-WordPress-with-members-portal_~01e64b461aadfbdbb1/",
        "Posted": "6 hours ago",
        "Type": "One-time project",
        "Level": "Intermediate",
        "Estimated Time": "1 to 3 month",
        "Skill": "Website Redesign Jobs",
        "Detail": "Redeveloping an existing website as a PWA to deliver:\n- An updated and improved design\n- Update public-facing content as required\n- The ability for new customers to subscribe to member's area\n\nMember's area where:\n- Paid content can be accessed by current paid members\n- Members can manage their subscriptions\n- Members can complete search & view functions\n- Stripe integration essential"
    },
    {
        "Job No": "92",
        "Title": "Hotel Website Development",
        "Job Page Link": "https://upwork.com/job/Hotel-Website-Development_~01827e71001b69f589/",
        "Posted": "6 hours ago",
        "Type": "One-time project",
        "Level": "Expert",
        "Estimated Time": "No Data",
        "Skill": "Wireframes Jobs",
        "Detail": "Looking for a web designer to build a website for a hotel. Prior experience with hotel website development is preferred with background knowledge of hotel booking and management integrations. Website design inspiration, structure copywriting, and references will be provided.\nWebsite must be built within ADA compliance and SEO integration. Website can be built on platform or from scratch as long as there is a CMS team can use to update and write new articles on blog."
    },
    {
        "Job No": "93",
        "Title": "Google Play Store Policy Expert Advice",
        "Job Page Link": "https://upwork.com/job/Google-Play-Store-Policy-Expert-Advice_~016562bdd94ddc0c8b/",
        "Posted": "6 hours ago",
        "Type": "One-time project",
        "Level": "Expert",
        "Estimated Time": "No Data",
        "Skill": "Android Jobs",
        "Detail": "We are a building an application which would be highly scrutinized from a application policy perspective.\n\nWe are interested in speaking with an expert for 15-30 minutes, and a 1 page deliverable which describes the application approval risks and ways to manage."
    },
    {
        "Job No": "94",
        "Title": "Developer needed to create an app (iOS & Andriod + Web)",
        "Job Page Link": "https://upwork.com/job/Developer-needed-create-app-iOS-amp-Andriod-Web_~0152693bf7d9c20512/",
        "Posted": "6 hours ago",
        "Type": "Ongoing project",
        "Level": "Intermediate",
        "Estimated Time": "No Data",
        "Skill": "User Profile Creation Jobs",
        "Detail": "Start-up company very similar to upwork but for everyday life. We want to launch in the new year, so deadline for completion would be early September."
    },
    {
        "Job No": "95",
        "Title": "Developer needed for webpage in ReactJS for interactive visualisation of SQL database",
        "Job Page Link": "https://upwork.com/job/Developer-needed-for-webpage-ReactJS-for-interactive-visualisation-SQL-database_~0167ddad2abda4ddef/",
        "Posted": "6 hours ago",
        "Type": "One-time project",
        "Level": "Intermediate",
        "Estimated Time": "No Data",
        "Skill": "Animation Jobs",
        "Detail": "The deliverable is a static webpage, deployed in an AWS S3 bucket, and written in ReactJS which generates the following visualisation of a SQL database:\n\nTime series of specific columns.\nMap of geo-referenced values of columns.\n\nAll the plots should filter actively by specific filters defined by the user on specific columns."
    },
    {
        "Job No": "96",
        "Title": "Need Fullstack Developer with AWS Serverless experience to help develop a SaaS App",
        "Job Page Link": "https://upwork.com/job/Need-Fullstack-Developer-with-AWS-Serverless-experience-help-develop-SaaS-App_~0155fd9ac07dfe6b45/",
        "Posted": "6 hours ago",
        "Type": "One-time project",
        "Level": "Intermediate",
        "Estimated Time": "No Data",
        "Skill": "AngularJS Jobs",
        "Detail": "Fun and exciting project. Developing a SaaS web app. The web app is 70% CRUD operations. If this project is successful we want to engage longterm.\n\nSample scope:\n\nHome/Landing page display some product branding and a gallery\nUser account management\nProject creation feature\nDashboard showing user project\nPayment for project download\n\nThe right developer will have experience in the following:\n\n1. Experience with AWS serverless architecture. Having experience with Docker is also great.\n2. Experience integrating third party RESTful APIs.\n3. Experience working with static file storage.\n4. Expert in Javascript or Python.\n5. Experience in designing UI/UX, wireframing, mockups etc. and developing frontend using Vue.js, React.js, etc.\n6. Experience in database design and architecture. Using SQL or NoSql databases.\n7. Experience integration payment functionality\n8. Deliver well written and tested code.\n9. Follow the best coding practices and the application needs to be secure.\n\nDeliverables:\n\n1. Webapp with AWS Serverless\n2. Code in GitHub\n3. Documentation\n\nYou will be given clear requirements for each deliverable/milestone. Timelines will be discussed and agreed upon.\n\nThat’s enough about the project, to ensure you’ve read the entirety of this message, please include the name of your favorite Rock Band (or whichever band you like) alongside your portfolio/cover letter in your reply. Looking forward to working with you."
    },
    {
        "Job No": "97",
        "Title": "Development React.JS 10 Screens Design + API Integration",
        "Job Page Link": "https://upwork.com/job/Development-React-Screens-Design-API-Integration_~01044b88763246748f/",
        "Posted": "6 hours ago",
        "Type": "One-time project",
        "Level": "Intermediate",
        "Estimated Time": "No Data",
        "Skill": "React Jobs",
        "Detail": "We have a running Web Application that needs following.\n1.Frontend development in React.JS of 10 screens.\n2. Integrating them with backend using API provided by us.\nThe front end template will provided from our side in which the designs need to be developed.\nRough wireframes of all the screens are mentioned here,\nHi Please see this link (https://drive.google.com/file/d/1vaAWvR_6sBaWU3rfyt9n8MMUvpbsoulf/view?usp=sharing) . There are around 60 screens out of which 10 will be shared with you. These screens need to be developed . You need to code these screens in React using a template https://cleanuitemplate.com/admin/react/preview/#/dashboard/alpha\nOnce coded you have to integrate API's to it as well which will be provided by us. Please let me know your price and timelines on a fixed price basis"
    },
    {
        "Job No": "98",
        "Title": "B2B Ecomm website",
        "Job Page Link": "https://upwork.com/job/B2B-Ecomm-website_~01ba5d54b2d79416ee/",
        "Posted": "7 hours ago",
        "Type": "Ongoing project",
        "Level": "Entry level",
        "Estimated Time": "1 to 3 month",
        "Skill": "Web Design Jobs",
        "Detail": "b2b listing website\n\ndocument attached below\n\nCan have look at zillow for reference https://www.zillow.com/\nWith basic functionality\nCan have look at https://www.olx.in/ as well\n\n\nI will provide the basic wireframe\n\nWritten content for about, blog, faq will be provided by me"
    },
    {
        "Job No": "99",
        "Title": "FUll-stack developer build a full Educational Website",
        "Job Page Link": "https://upwork.com/job/FUll-stack-developer-build-full-Educational-Website_~014f3b9a06260cf9ea/",
        "Posted": "7 hours ago",
        "Type": "Ongoing project",
        "Level": "Intermediate",
        "Estimated Time": "No Data",
        "Skill": "No Data",
        "Detail": "I want to Make a Full Educational Website\nA) Front-End Development\nI have my own XD Design I want to Improve in it a little bit\nWe Will Design and Code (10 Pages Templates will be Designed )\n\nB) Back-End Development\nI want to add Database - accounts added for the site - admins can control everything in the website\n\nit will be only like a test for the Developer but it will be a long term job to develop Every MOnth in our website we are a startup and it will be a long term job\n\nif you read the Description send at the first of YOu Message = \" Hello Ahmed\""
    },
    {
        "Job No": "100",
        "Title": "Virtual Assistant Needed for Real Estate Data Extraction / Entry",
        "Job Page Link": "https://upwork.com/job/Virtual-Assistant-Needed-for-Real-Estate-Data-Extraction-Entry_~01ab213020f9bb2b39/",
        "Posted": "7 hours ago",
        "Type": "One-time project",
        "Level": "Entry level",
        "Estimated Time": "Less than 1 month",
        "Skill": "Web Scraper Jobs",
        "Detail": "I am looking to hire a virtual assistant to help me gather and build a database of real estate professionals: agents, brokers, lenders, developers, investors, builders, and service providers."
    }
]